// Used in command prompt for loading to MongoDB

db.articles.insert([
  {
    "name": "01132021",
    "title": "The News",
    "datetime": "2021-01-13T18:00:00-05:00",
    "content": "<p>This isn’t how it’s supposed to go… A doctor in his/her 50’s is supposed to be in a white lab coat, behind a large desk with diplomas on the wall (4 minimum, which means there might be a high school diploma up there or something), my wife and I sitting side-by-side, upright, holding hands. Instead I’m crammed in the corner of a hospital room, Heather groggily waking up from the procedure, a doctor younger than I giving us details we’ll eventually have two recollections about and trying to express an urgency with terms like “malignancy” without freaking us out by saying “cancer”. I guess TV & movies don’t always get it right. Still the news hits us like a ton of feathers, still weighs as much as a ton of bricks, but a much slower drop. We knew from a regular ultrasound that there was a 4 inch growth, and we didn’t elect for an endoscopic ultrasound because it sounded enjoyable, so this isn’t a big shock to us. It was a possible outcome. We’re partly glad that we have less unknown, a direction to head. It also sucks that it’s cancer. I think a result like “we don’t know what it is, but it’s definitely not cancer” would have been better, but that’s not what we got. I don’t know if the correct setting would have made a difference.</p>",
    "upvotes": 0,
    "comments": []
  },
  {
    "name": "01162021",
    "title": "Communication",
    "datetime": "2021-01-16T15:00:00-05:00",
    "content": "<p>I’m avoiding researching things online. Part of me thinks this is good. The last thing I want to do is be awake at 3 am reading about liver enzyme synthesis, wondering if I still have an organic chemistry textbook that I could do some reading up in. I suppose this is a lesson learned from COVID: interesting research topic + stressful situation = sleepless nights. Another part of me thinks I’m avoiding the problem.</p><p>Perhaps there’s a website that explains how to communicate a cancer diagnosis with your family, friends & coworkers. Heather told her coworkers on Thursday. I was inclined to keep the business owners in the loop so they weren’t surprised if she’s working weirder hours, etc. The feedback she’s getting from other coworkers is more of the annoying “my mother had cancer and…” kind of stories. I’m immensely skeptical about one where the person healed themselves by diet, and very curious if it’s a coincidence that I’ve heard it three times from Heather, or if she’s really clinging to the story like an emotional life-preserver.</p><p>We told her parents right away on Wednesday, which prompted a phone call from her sister. Since my mom and stepdad are here and knew about Wednesday’s procedure I told them on Thursday, but with the explicit instruction to not tell my brothers; I love them but I’m afraid of this story getting out. I’m working hard on the spin control. I don’t want people to overreact, in part because so far we don’t know how much reaction is under/over and Heather and I are choosing to reserve our reaction for enough facts to warrant a reaction. I’d also like to avoid being annoyed by the “is there anything I can do question” or other signs of concern. I want signs of concern, just not too many. So when I emailed my office some details on Friday at 4:45 and told them to not reply to my email, I was still checking my email over the weekend for the person that would ignore my request, and then getting disappointed when there wasn’t any sort of message because I did want to be important to people.</p><p>So I set a Zoom to tell my brothers and my dad. It’s difficult to coordinate something and invite people to a conversation with a certain level of importance without giving away the details. The child-free request was particularly challenging because I knew once the 3, 4, 5, 6 year olds get on the call, they can quickly consume it. It all came together, although there’s a certain weirdness to “let’s get everybody together for a 5 minute announcement”. Certainly had the feel of work meetings that stop being useful before the hour is up, but nobody knows how to say that everything is accomplished. There were a couple of follow-up questions, but everybody is either stunned or realises that there aren’t enough details yet to make too much conversation. Even the nieces and nephews made cameos but failed to relieve the awkwardness.</p><p>I still haven’t told too many people at church. There’s too much variation in the experience with cancer to share broadly. Also I’d really like to not answer a bunch of questions.</p>",
    "upvotes": 0,
    "comments": []
  },
  {
    "name": "01202021",
    "title": "No News",
    "datetime": "2021-01-20T16:00:00-05:00",
    "content": "<p>The GI doctor said that he was sending the results and giving us a referral to an oncologist and that we should hear by Friday. Sure Monday was a holiday but today seems like patience enough. Heather called and found that the GI doctor that did the scoping talked to the GI doctor that Heather normally sees and that no resolution came about. But they’ll get working on that. Glad she called.</p>",
    "upvotes": 0,
    "comments": []
  },
  {
    "name": "01212021",
    "title": "An Appointment",
    "datetime": "2021-01-21T11:00:00-05:00",
    "content": "<p>Oh good, a call from the oncologist. I don’t know if we should be scared that we’re getting appointments so quickly. I guess we’ll find out this afternoon.</p>",
    "upvotes": 0,
    "comments": []
  },
  {
    "name": "01212021-2",
    "title": "A Diagnosis, almost",
    "datetime": "2021-01-21T17:00:00-05:00",
    "content": "<p>Ok, that was heavy. Still not a  ton of bricks, but definitely not a ton of feathers. What’s between? How about a ton of water, I think that’s a little less than 250 gallons, sounds about right. Also how else are you supposed to take “poorly differentiated squamous cell metastatic carcinoma”. Oh, you’re not a medical professional; let’s break it down, backwards.</p><p>Carcinoma: Cancer, that’s one’s easy</p><p>Metastatic: Spreading, not good</p><p>Squamous cell: Cells that make up the external layer, like skin, but also places where the outside meets the insides, like sinuses, esophagus, lungs, anus, bladder. I.e. not the liver. (Also “squamous” is a fun word to hear and say.)</p><p>Poorly differentiated: Not showing an obvious starting location</p><p>A series of tests on the biopsy samples failed to indicate the origin of the squamous cells. So we know there’s a big lump in the liver, and that it’s messing with things, but it didn’t start there so treating that only means another comes back. Also, since there are lesions on both livers it would probably mean removing nearly all of the liver, which is a bit too much, given that we can’t get a transplant because if the cancer source is uninterrupted, then it’ll just ruin the transplant. There may be treatments (surgery, radiation, injected medicine) to shrink it and alleviate the symptoms, but more information is needed to determine if that happens. It probably ended up in the liver because the liver filters the blood.</p><p>Since we don’t know where it’s coming from, we’ll have to wait on treatment. To learn it’s origin story, we’re starting with a PET scan, in which Heather will get injected with radioactive “sugar” and the cancerous parts are sugar fiends, so they should light up like Christmas lights. But the brain is also a sugar fiend, so if there’s any there, it won’t show. Give a couple of symptom questions Heather answered yes to, like balance issues, a brain MRI is also ordered to rule things out. The blood work didn’t show anything outside of the ordinary, so that means that things haven’t completely fallen apart. It’s also odd that Heather had a wide series of doctors check-ups last year that didn’t find anything: dermatologist, pap smear, mammogram, colonoscopy.</p><p>I don’t know that I’ve had an hour-and-half conversation with a doctor. At least not one that wasn’t a friend of mine and then we were talking about things other than medicine. So the doctor is definitely personable. Plus he’s willing to really explain things. And he was willing to discuss the unknowns and the uncertainties. I also liked how he really considered the whole of Heather (I would use the word “holistic” but that has a different meaning around herbal remedies, acupuncture, etc.) such as trying to figure out where her cough originates and what can be done about her neck pain. In that regard, he cleared the regular taking of Aleve, as in 2 pills a day for multiple days. Given how effective they’ve been with the neck pain, I am very excited for this news. Also he had strict instructions about not losing any more weight. Particularly the doctor doesn’t want Heather to give up on eating because it’s such a vicious cycle. So while healthy is preferred, calories are what count.</p><p>Yeah, it’s a lot. Today was a lot. And another cycle of how to tell people begins.</p>",
    "upvotes": 0,
    "comments": []
  }
])
